RRN_Data/2238000/2238082.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Body><d2LogicalModel xmlns="http://datex2.eu/schema/2/2_0" modelBaseVersion="2"><exchange><supplierIdentification><country>fr</country><nationalIdentifier>Tipi</nationalIdentifier></supplierIdentification><subscription><operatingMode>operatingMode1</operatingMode><subscriptionStartTime>2025-01-07T20:34:59.983+01:00</subscriptionStartTime><subscriptionState>active</subscriptionState><updateMethod>allElementUpdate</updateMethod><target><address/><protocol/></target></subscription></exchange><payloadPublication xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="SituationPublication" lang="fr"><publicationTime>2025-01-07T20:34:59.983+01:00</publicationTime><publicationCreator><country>fr</country><nationalIdentifier>Tipi</nationalIdentifier></publicationCreator><situation id="250107-002295" version="4"><overallSeverity>medium</overallSeverity><situationVersionTime>2025-01-07T20:34:59.011+01:00</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="VehicleObstruction" id="250107-002295-1" version="4"><situationRecordCreationTime>2025-01-07T19:58:56.366+01:00</situationRecordCreationTime><situationRecordObservationTime>2025-01-07T20:33:50.008+01:00</situationRecordObservationTime><situationRecordVersionTime>2025-01-07T20:34:59.011+01:00</situationRecordVersionTime><situationRecordFirstSupplierVersionTime>2025-01-07T19:58:56.366+01:00</situationRecordFirstSupplierVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceIdentification>Gendarmerie/CORG</sourceIdentification><sourceName><values><value lang="fr">CORG 18 (Cher)</value></values></sourceName><reliable>true</reliable></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2025-01-07T19:58:56.366+01:00</overallStartTime></validityTimeSpecification></validity><impact><originalNumberOfLanes>2</originalNumberOfLanes></impact><generalPublicComment><comment><values><value lang="fr">Point particulier : début : situé 541 m au nord de Massay nord, fin : situé 2869 m au sud de Vierzon-Bourgneuf</value></values></comment><commentType>locationDescriptor</commentType></generalPublicComment><generalPublicComment><comment><values><value lang="fr">DIR Centre-Ouest/District A20/CEI Vatan</value></values></comment><commentType>locationDescriptor</commentType></generalPublicComment><generalPublicComment><comment><values><value lang="fr">De Toulouse vers Paris</value></values></comment><commentType>locationDescriptor</commentType></generalPublicComment><groupOfLocations xsi:type="Linear"><tpegLinearLocation><tpegDirection>northBound</tpegDirection><tpegLinearLocationType>segment</tpegLinearLocationType><to xsi:type="TpegNonJunctionPoint"><pointCoordinates><latitude>47.1833</latitude><longitude>2.0139892</longitude></pointCoordinates><name><descriptor><values><value lang="fr">Massay</value></values></descriptor><tpegOtherPointDescriptorType>townName</tpegOtherPointDescriptorType></name><name><descriptor><values><value lang="fr">A20</value></values></descriptor><tpegOtherPointDescriptorType>linkName</tpegOtherPointDescriptorType></name></to><from xsi:type="TpegNonJunctionPoint"><pointCoordinates><latitude>47.17958</latitude><longitude>2.0116093</longitude></pointCoordinates><name><descriptor><values><value lang="fr">Massay</value></values></descriptor><tpegOtherPointDescriptorType>townName</tpegOtherPointDescriptorType></name><name><descriptor><values><value lang="fr">A20</value></values></descriptor><tpegOtherPointDescriptorType>linkName</tpegOtherPointDescriptorType></name></from></tpegLinearLocation><alertCLinear xsi:type="AlertCMethod4Linear"><alertCLocationCountryCode>F</alertCLocationCountryCode><alertCLocationTableNumber>32</alertCLocationTableNumber><alertCLocationTableVersion>11.0</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>negative</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><alertCLocationName><values><value lang="fr">Vierzon-Bourgneuf</value></values></alertCLocationName><specificLocation>12018</specificLocation></alertCLocation><offsetDistance><offsetDistance>2869</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation><alertCMethod4SecondaryPointLocation><alertCLocation><alertCLocationName><values><value lang="fr">Massay nord</value></values></alertCLocationName><specificLocation>12019</specificLocation></alertCLocation><offsetDistance><offsetDistance>541</offsetDistance></offsetDistance></alertCMethod4SecondaryPointLocation></alertCLinear><linearWithinLinearElement><directionRelativeOnLinearSection>opposite</directionRelativeOnLinearSection><linearElement><roadNumber>A0020</roadNumber></linearElement><fromPoint xsi:type="DistanceFromLinearElementReferent"><distanceAlong>700.0</distanceAlong><fromReferent><referentIdentifier>18PR8G</referentIdentifier><referentType>referenceMarker</referentType></fromReferent></fromPoint><toPoint xsi:type="DistanceFromLinearElementReferent"><distanceAlong>200.0</distanceAlong><fromReferent><referentIdentifier>18PR9G</referentIdentifier><referentType>referenceMarker</referentType></fromReferent></toPoint></linearWithinLinearElement></groupOfLocations><situationRecordExtension><situationRecordExtendedApproved><safetyRelatedMessage>true</safetyRelatedMessage></situationRecordExtendedApproved></situationRecordExtension><vehicleObstructionType>brokenDownVehicle</vehicleObstructionType><obstructingVehicle><vehicleCharacteristics><vehicleType>lorry</vehicleType></vehicleCharacteristics></obstructingVehicle></situationRecord><situationRecord xsi:type="RoadOrCarriagewayOrLaneManagement" id="250107-002295-104" version="1"><situationRecordCreationTime>2025-01-07T20:33:50.008+01:00</situationRecordCreationTime><situationRecordObservationTime>2025-01-07T20:33:50.008+01:00</situationRecordObservationTime><situationRecordVersionTime>2025-01-07T20:34:59.011+01:00</situationRecordVersionTime><situationRecordFirstSupplierVersionTime>2025-01-07T20:33:50.008+01:00</situationRecordFirstSupplierVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceIdentification>Direction interdépartementale des routes/DIR Centre-Ouest</sourceIdentification><sourceName><values><value lang="fr">CEI Vatan</value></values></sourceName><reliable>true</reliable></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2025-01-07T20:33:50.008+01:00</overallStartTime></validityTimeSpecification></validity><impact><originalNumberOfLanes>2</originalNumberOfLanes><trafficConstrictionType>lanesBlocked</trafficConstrictionType></impact><generalPublicComment><comment><values><value lang="fr">Point particulier : début : situé 541 m au nord de Massay nord, fin : situé 2869 m au sud de Vierzon-Bourgneuf</value></values></comment><commentType>locationDescriptor</commentType></generalPublicComment><generalPublicComment><comment><values><value lang="fr">DIR Centre-Ouest/District A20/CEI Vatan</value></values></comment><commentType>locationDescriptor</commentType></generalPublicComment><generalPublicComment><comment><values><value lang="fr">De Toulouse vers Paris</value></values></comment><commentType>locationDescriptor</commentType></generalPublicComment><groupOfLocations xsi:type="Linear"><supplementaryPositionalDescription><affectedCarriagewayAndLanes><carriageway>mainCarriageway</carriageway><lane>lane1</lane></affectedCarriagewayAndLanes></supplementaryPositionalDescription><tpegLinearLocation><tpegDirection>northBound</tpegDirection><tpegLinearLocationType>segment</tpegLinearLocationType><to xsi:type="TpegNonJunctionPoint"><pointCoordinates><latitude>47.1833</latitude><longitude>2.0139892</longitude></pointCoordinates><name><descriptor><values><value lang="fr">Massay</value></values></descriptor><tpegOtherPointDescriptorType>townName</tpegOtherPointDescriptorType></name><name><descriptor><values><value lang="fr">A20</value></values></descriptor><tpegOtherPointDescriptorType>linkName</tpegOtherPointDescriptorType></name></to><from xsi:type="TpegNonJunctionPoint"><pointCoordinates><latitude>47.17958</latitude><longitude>2.0116093</longitude></pointCoordinates><name><descriptor><values><value lang="fr">Massay</value></values></descriptor><tpegOtherPointDescriptorType>townName</tpegOtherPointDescriptorType></name><name><descriptor><values><value lang="fr">A20</value></values></descriptor><tpegOtherPointDescriptorType>linkName</tpegOtherPointDescriptorType></name></from></tpegLinearLocation><alertCLinear xsi:type="AlertCMethod4Linear"><alertCLocationCountryCode>F</alertCLocationCountryCode><alertCLocationTableNumber>32</alertCLocationTableNumber><alertCLocationTableVersion>11.0</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>negative</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><alertCLocationName><values><value lang="fr">Vierzon-Bourgneuf</value></values></alertCLocationName><specificLocation>12018</specificLocation></alertCLocation><offsetDistance><offsetDistance>2869</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation><alertCMethod4SecondaryPointLocation><alertCLocation><alertCLocationName><values><value lang="fr">Massay nord</value></values></alertCLocationName><specificLocation>12019</specificLocation></alertCLocation><offsetDistance><offsetDistance>541</offsetDistance></offsetDistance></alertCMethod4SecondaryPointLocation></alertCLinear><linearWithinLinearElement><directionRelativeOnLinearSection>opposite</directionRelativeOnLinearSection><linearElement><roadNumber>A0020</roadNumber></linearElement><fromPoint xsi:type="DistanceFromLinearElementReferent"><distanceAlong>700.0</distanceAlong><fromReferent><referentIdentifier>18PR8G</referentIdentifier><referentType>referenceMarker</referentType></fromReferent></fromPoint><toPoint xsi:type="DistanceFromLinearElementReferent"><distanceAlong>200.0</distanceAlong><fromReferent><referentIdentifier>18PR9G</referentIdentifier><referentType>referenceMarker</referentType></fromReferent></toPoint></linearWithinLinearElement></groupOfLocations><situationRecordExtension><situationRecordExtendedApproved><safetyRelatedMessage>false</safetyRelatedMessage></situationRecordExtendedApproved></situationRecordExtension><complianceOption>mandatory</complianceOption><roadOrCarriagewayOrLaneManagementType>laneClosures</roadOrCarriagewayOrLaneManagementType></situationRecord></situation></payloadPublication></d2LogicalModel></soap:Body></soap:Envelope>